app/views/page/_issue_list.html.erb

SELECT COUNT(*) FROM "comments"  WHERE "comments"."issue_id" = ?  [["issue_id", 10]]
---
          <i class="fa fa-comments icon-muted"></i>
          <%= link_to i.comments.count, i %>