app/controllers/comments_controller.rb

  def create
   @comment = Comment.new(comment_params)
   @comment.save
---
INSERT INTO "comments" ("content", "created_at", "email", "issue_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["content", "大法师"], ["created_at", "2017-05-06 15:11:56.074817"], ["email", "tian128333work@163.com"], ["issue_id", 9], ["updated_at", "2017-05-06 15:11:56.074817"], ["username", "你好"]]