app/controllers/issues_controller.rb

SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @issue = Issue.find(params[:id])

INSERT INTO "issues" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "好吃的"], ["created_at", "2017-05-07 12:56:40.297429"], ["title", "吃饭"], ["updated_at", "2017-05-07 12:56:40.297429"], ["user_id", 2]]
---
  def create
    Issue.create(issue_params)

SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 1]]
---
  def destroy
    issue = Issue.find(params[:id])
    issue.destroy

SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @issue = Issue.find(params[:id])

SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "issues" SET "content" = ?, "updated_at" = ? WHERE "issues"."id" = 2  [["content", "Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod23"], ["updated_at", "2017-05-06 14:20:05.582537"]]
---
  def update
    i = Issue.find(params[:id])
    i.update_attributes(issue_params)