app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
     if @user.save
---
INSERT INTO "users" ("auth_token", "created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def create_login_session
    user = User.find_by_name(params[:name])
---
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'tianyu' LIMIT 1